{
    "pages": [
        {
            "title": "Exercícios de inglês e espanhol", 
            "text":"Alguns dias atrás eu descobri que a minha amiga Kelly Dias mantém o blog http://interajaagora.blogspot.com.br/ e ela posta muitas dicas sobre inglês e espanhol. Ela mantém uma seção de exercícios. Então se você está estudando uma dessas línguas e quer se aprimorar em um tópico específico acesse a seção de exercícios de inglês ou exercícios de espanhol e faça os exercícios. No blog dela também há muitos links para sites externos com muitas aulas interessantes e ela também aceita o recebimento de dúvidas no e-mail: contato_interajaagora@yahoo.com.br. Então não perca tempo e acesse o blog http://interajaagora.blogspot.com.br/. Bons estudos!", 
            "tags": "inglês", 
            "loc": "/2013/12/02/exercicios-de-ingles-e-espanhol/"
        },
        {
            "title": "Palestra online sobre firewalls pela Fundação Bradesco", 
            "text":"Updated: 27/11/2013 16h45 UTC-2 Boa [STRIKEOUT:noite] tarde, [STRIKEOUT:Amanhã], No dia 25/11/23 às 14h, [STRIKEOUT:vou apresentar] eu apresentei uma palestra sobre firewalls pela Fundação Bradesco. Se você estiver interessado em saber o básico sobre firewalls CheckPoint acesse o link http://videos3.fb.org.br/FundacaoBradesco/Eventos/25112013OUsodeFirewallsnaSegurancadeRedes/25112013OUsodeFirewallsnaSegurancadeRedes.html [STRIKEOUT:se registre] para assistir a palestra. Se você preferir você pode fazer o download dos slides da apresentação no link a seguir: Slides da Palestra sobre Firewalls. Se tiver dúvidas deixa a sua pergunta nos comentários desse post. Abraços!", 
            "tags": "redes", 
            "loc": "/2013/11/24/palestra-online-sobre-firewalls-fundacao-bradesco/"
        },
        {
            "title": "Como estudar inglês", 
            "text":"Tenho recebido muitas perguntas sobre como estudar inglês por conta própria. Algumas pessoas que tem me procurado querem começar a estudar do zero e outras já tem um conhecimento intermediário e querem aprimorar suas habilidades na língua inglesa. Nesse post vou compartilhar algumas dicas para esses dois grupos de pessoas. Vocabulário: Se você não tem muito conhecimento de inglês, só sabe aquilo que aprendemos no ensino médio, e quer começar a estudar você pode usar o site Language Guide para começar os seus estudos. Nesse site você pode estudar várias línguas, mas vamos focar na língua inglesa. Comece acessando esse link http://www.languageguide.org/inglês/. Nessa primeira seção você vai encontrar um guia de vocabulário, é um guia super interativo, basta escolher um tópico que você quer aprender e passar os mouse em cima das figuras e você vai ouvir a pronúncia da palavra escolhida. Dessa forma você pode aprender várias palavras novas em único dia e já vai saber a pronúncia correta. São setenta e sete tópicos diferentes com várias palavras a disposição. Para treinar vocabulário e aprender novas palavras você também pode usar o site http://www.duolingo.com/ esse site também provê um aplicativo para celulares Android e iPhone que você pode baixar e fazer as aulas direto no seu celular. Gramática: Depois você pode acessar a guia de gramática, que é um curso de inglês completo dividido em quatro partes. Basta acessar os links abaixo e ler as páginas, passe o mouse por cima das frases em inglês para ouvir a pronúncia das frases. Links: Parte 1, Parte 2, Parte 3 e Parte 4. O guia de gramática também pode ser usado por quem já tem um conhecimento intermediário e quer revisar ou relembrar alguns tópicos. Intermediário e avançado: Depois que você passar pela parte básica e conseguir ler textos em inglês você pode usar outros sites de conteúdo mais amplo e que trazem o texto escrito completamente em inglês. Um site muito bom é o site do jornal Voice of America, http://learningenglish.voanews.com/, esse site tem a seção Learn English onde você encontra notícias em inglês e o apresentador fala bem devagar, assim você pode acompanhar o texto enquanto ouve a notícia. Isso é muito bom porque você já aprende a pronúncia correta das palavras e já se acostuma com o sotaque do inglês americano. Acesse o site http://learningenglish.voanews.com/ e clique no link de uma notícia, na página da notícia você verá do lado esquerdo uma seção chamada MULTIMEDIA, clique no link Listen, aparecerá uma nova janela com um player de áudio, clique no botão play para ouvir a notícia e acompanhe o texto na página da notícia. Nesse site também tem uma seção chamada Learn English TV, que traz vídeos com legendas em inglês e os apresentadores falam bem devagar para que você possa acompanhar. Acesse esse link para ver os vídeos: http://learningenglish.voanews.com/media/all/latest.html?z=3613. Veja também os vídeos da seção English in a Minute, onde os professores explicam o uso das expressões idiomáticas no inglês americano, as aulas nesses vídeos curtos são completamente em inglês e também trazem a legenda para você acompanhar. Acesse esse link para ver os vídeos: http://learningenglish.voanews.com/media/all/latest.html?z=3619. Se você tem dúvidas de gramática e já lê em inglês com facilidade veja as explicações no site The Purdue Online Writing Lab, nesse link https://owl.english.purdue.edu/owl/section/1/5/. Há explicações sobre vários tópicos como adjetivos, advérbios, preposições, pronomes, etc. O site de notícias da BBC UK também oferece muitos recursos para estudar inglês. Acesse o link http://www.bbc.co.uk/worldservice/learningenglish/. Navegue no menu do lado esquerdo para escolher entre as seções General &amp; Businesse English, Grammar, vocabulary &amp; pronunciation e outros. Como você pode ver há muitos recursos gratuitos na internet para você estudar e aprimorar o seu inglês. Se você tem alguma dica para compartilhar deixe o seu comentário. Bons estudos e boa sorte!", 
            "tags": "inglês", 
            "loc": "/2013/10/19/como-estudar-ingles/"
        },
        {
            "title": "Slides da Palestra sobre Software Livre e Código Aberto", 
            "text":"No dia 19 de setembro de 2013 eu ministrei uma palestra sobre Software Livre e Código Aberto na Unidade 2 das Faculdades Anhanguera Campinas. Estou postando os slides da palestra assim você pode ter uma idéia do que foi apresentado. Acesse os slides nesse link: Software Livre e Código Aberto.", 
            "tags": "linux", 
            "loc": "/2013/09/24/slides-da-palestra-sobre-software-livre-e-codigo-aberto/"
        },
        {
            "title": "Usando o Slax Linux", 
            "text":"O Slax é uma versão portável do Linux baseada na distribuição Slackware. O Slax traz o Firefox, mplayer (player multimedia), okular (leitor de PDF), gwenviewer (vizualizador de imagens), muitos outros programas e o desktop KDE em uma imagem de aproximadamente 220Mb e que está disponível em várias línguas. Para usar o Slax no seu computador você deve fazer o download nesse link http://www.slax.org/en/download.php Você verá quatro opções de download: Download for CD - duas imagens ISO (32 bits e 64 bits) que você pode usar numa máquina virtual como o VirtualBox ou queimar num CD/DVD para dar boot no seu computador. Download for USB - dois arquivos compactados no formato ZIP (32 bits e 64 bits) que você pode usar num pendrive para dar boot no seu computador. Se a sua máquina tem mais de 4GB de memória RAM e/ou um processador com mais de um núcleo (exemplos dual core, quad core, corei3,5,7) use a versão 64 bits. Para usar o Slax em Portugês num pendrive acesse a página de download, vá até a linha &#34;Slax Brazilian (Portuguese)&#34; e selecione uma das opções &#34;32 bit ZIP&#34; ou &#34;64 bit ZIP&#34;. Quando download terminar, copie o arquivo ZIP no seu pendrive (na minha máquina o pendrive foi reconhecido como E:\, use a letra que o Windows detectar) e descompacte o arquivo na raiz do pendrive, entre na pasta E:\slax\boot e execute o script bootinst.bat. Se tudo der certo o seu pendrive já vai estar inicializável. Obs: Se você já está usando o Linux e quer testar o Slax descompacte o arquivo no pendrive e execute o script slax/boot/bootinst.sh. Você deve reiniciar a sua máquina com o pendrive conectado em uma porta USB e na tela inicial da BIOS você deve pressionar uma tecla para escolher a opção de boot pelo pendrive (USB disk), essa tecla varia em cada computador, normalmente é uma das teclas F8, F9, F10 ou ESC. Depois de escolher a opção de boot pelo pendrive (USB disk) você verá a tela de boot do Slax, você pode apertar a tecla TAB para mudar as opções ou simplesmente escolher a opção &#34;Run Slax&#34; e pressionar a tecla ENTER. Escolhendo essa opção padrão o Slax vai iniciar o no modo gráfico com o KDE. Se o Slax não reconhecer a placa de rede wireless ou algum outro hardware da sua máquina você deve conectar na Internet usando a placa de rede comum, com um cabo de rede, e abrir a &#34;Central de Programas&#34; e fazer o download do módulo &#34;Linux Firmware&#34; depois reinicie o Slax e tente novamente. Boa sorte!", 
            "tags": "linux, slackware", 
            "loc": "/2013/09/20/usando-o-slax-linux/"
        },
        {
            "title": "Novo blog e novo domínio", 
            "text":"Boa noite, Depois de muito tempo sem publicar nada decidi fazer várias mudanças. Registrei um novo domínio e comecei esse novo blog. Todo o conteúdo do meu blog antigo (tdmsilvino.wordpress.com) foi importado nesse novo blog. Assim que eu terminar de fazer todos os ajustes que desejo vou redirecionar o blog antigo para cá. Nesse novo blog vou escrever sobre software livre, Linux, redes, firewall, inglês e qualquer outro assunto que achar relevante. Esse blog não será apenas sobre tecnologia da informação, vou tentar concentrar as minhas informações pessoais públicas nesse domínio silvino.net e a minha &#34;identidade virtual&#34; estará aqui, não estará no facebook, g+ ou twitter, eu não vou deletar o meu perfil nesses serviços mas a maior parte das minhas informações vão sumir de lá em breve. Vou fazer alguns experimentos com owncloud e aos poucos vou deixar de usar serviços de terceiros que podem ser facilmente subvertidos. Um dia desses eu estava pensando sobre como estamos dependentes do Google e os outros gigantes da web e me perguntei: o que aconteceria se o Google decidisse cancelar a minha conta? Eu perderia os meus contatos, o meu e-mail, os arquivos do Google drive e muitas outras coisas. Fiz algumas pesquisas e vi que não é difícil disso acontecer. Depois de ler sobre o movimento IndieWebCamp eu percebi que a melhor forma de sair dessa  roubada é ter a posse da minha &#34;identidade virtual&#34;. Eu vou ter o meu próprio domínio, vou gerenciar o meu e-mail e os meus arquivos ou vou pagar para algum provedor gerenciar. O layout desse blog provavelmente mudará em alguns dias porque estou pensando numa  forma de postar artigos em inglês também e ainda estou pesquisando pra ver qual será a melhor forma de fazer isso. Mas já vou começar publicar alguns posts aqui. A nova identidade virtual do Thiago Silvino aka tdmsilvino estará aqui no silvino.net. []&#39;s", 
            "tags": "pessoal", 
            "loc": "/2013/09/08/novo-blog-novo-dominio/"
        },
        {
            "title": "Home", 
            "text":"", 
            "tags": "misc", 
            "loc": "/2013/09/08/home/"
        },
        {
            "title": "Slackware 13", 
            "text":"Acabei de ler o changelog no site slackware.com e temos uma novidade: O slackware 13 já está pronto, segue uma tradução livre da entrada no changelog: O Slackware 13.0 x86 foi lançado como estável! Obrigado a todos os que ajudaram a fazer isso possível -- veja o arquivo RELEASE_NOTES para os créditos. As imagens ISOs já estão no gravador.  Desta vez teremos um conjunto de 6 CD-ROM de 32-bits e um DVD de camada dupla 32-bit/64-bit x86/x86_64. Estamos aceitando pedidos de pré-venda no link store.slackware.com. Por favor considere pegar uma cópia para ajudar a suportar o projeto. Mais uma vez, obrigado a toda a comunidade do Slackware por toda a ajuda nos testes, correções e envio de sugestões durante o ciclo de desenvolvimento. Como sempre, divirtam-se e curtam a distro!  -P. Você pode ler o anúncio de lançamento no link abaixo: http://slackware.com/announce/13.0.php Agora é só baixar o Slackware e ver as novidades http://slackware.com/getslack/", 
            "tags": "slackware", 
            "loc": "/2009/08/28/slackware-13/"
        },
        {
            "title": "Novidades sobre o Slackware", 
            "text":"No dia 13 de agosto o Patrick, desenvolvedor do Slackware, anunciou que o KDE 4.1 foi incluído no Slackware. Por enquanto os pacotes estão no -current /testing, mas ele diz que toda a equipe de desenvolvimento, já está usando o KDE 4.1 sem nenhum problema. Para usar o KDE 4.1 você precisa atualizar o seu sistema para o -current e fazer o download dos pacotes em qualquer um dos mirrors do Slackware. Se você quiser usar um mirror do Brasil use o link abaixo, baixe toda a estrutura de sub-diretórios: ftp://ftp.slackware-brasil.com.br/slackware-current/testing/packages/kde4/ O arquivo README traz uma série de recomendações que devem ser seguidas. Além de atualizar o sistema para o -current, você deve remover todos os pacotes relacionados ao KDE 3, incluindo o qt, qca, qca-tls e knemo. Você deve fazer um backup e depois remover os seguintes diretórios: /etc/kde, $HOME/.kde. Entre no diretório com os pacotes do KDE 4.1 e use esse comando: upgradepkg --install-new deps/*.tgz extragear/*.tgz kde/*.tgz kde3-compat/*.tgz Dê uma olhada no arquivo README e mãos-à-obra. Bom, além do KDE 4.1 o time do Slackware desenvolveu um novo logo para o Slackware. Entre no site slackware.com e confira, o Patrick disse que o logo antigo era muito difícil de ler e de guardar na memória rsrsrsrsrs. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/08/16/novidades-sobre-o-slackware/"
        },
        {
            "title": "Voltando com a força toda", 
            "text":"ão postei mais nada no blog. Aproveitei esse tempo pra terminar de ler um livro preparatório para a certificação LPI. Também fiz a leitura dos livros &#34;Ruby - Investigando a Linguagem&#34; e &#34;Ruby on Rails - Executando&#34;. Já estou desenvolvendo algumas aplicações usando Rails. Então fica ai mais uma dica pra galera quem quer começar a usar o Rails, você pode comprar qualquer um dos vários livros disponíveis para compra e atualizar o seu conhecimento lendo os bons artigos disponíveis na Internet, segue uma breve lista: Primeiro tutorial completo de Rails 2.0 - parte 1 e parte 2 http://www.akitaonrails.com/2008/2/1/rolling-with-rails-2-0-o-primeiro-tutorial-completo-parte-1 http://www.akitaonrails.com/2008/2/1/rolling-with-rails-2-0-o-primeiro-tutorial-completo-parte-2 Rails scaffolding step by step http://fairleads.blogspot.com/2007/12/rails-20-and-scaffolding-step-by-step.html http://fairleads.blogspot.com/2008/01/this-is-second-part-of-my-series.html Primeiro tutorial completo de Rails 2.1 - parte 1 e parte 2 http://www.akitaonrails.com/2008/5/25/rolling-with-rails-2-1-the-first-full-tutorial-part-1 http://www.akitaonrails.com/2008/5/25/rolling-with-rails-2-1-the-first-full-tutorial-part-2 Primeiro livro de Rails 2.1 http://www.nomedojogo.com/2008/06/06/o-primeiro-livro-sobre-rails-21-e-brasileiro Durante esse período também fiz a instalação do Kurumin NG e indico essa distribuição pra qualquer brasileiro que seja iniciante no Linux e quer um Desktop pronto para uso. Depois que você se acostumar com o ambiente Linux e realmente quiser aprender a configurar todo o sistema e ir a fundo nas funcionalidades você deve partir para uma distro robusta e a minha indicação sempre será o bom e velho Slackware. Até mais.", 
            "tags": "pessoal", 
            "loc": "/2008/08/16/voltando-com-a-forca-toda/"
        },
        {
            "title": "Usando o dvdauthor para editar DVD&#39;s", 
            "text":"O dvdauthor pega os seus arquivos MPEG e gera arquivos IFO, BUP e VOB para gravar em um DVD. Você pode usar um arquivo de configuração no formato XML ou parâmetros na linha de comando para dizer ao dvdauthor como ele deve criar os arquivos VOB. Com o dvdauthor você pode criar menus e criar capítulos para cada título do seu DVD. Abaixo estou mostrando um exemplo de arquivo de configuração do dvdauthor: &lt;dvdauthor dest=&#34;dvd&#34;&gt; &lt;vmgm/&gt; &lt;titleset&gt; &lt;titles&gt; &lt;pgc&gt; &lt;vob file=&#34;filme01.mpeg&#34; chapters=&#34;0:00:20.00,0:10:20.00,0:20:20.00&#34; /&gt; &lt;vob file=&#34;filme02.mpeg&#34; chapters=&#34;0:00:20.00,0:10:20.00,0:20:20.00&#34; /&gt; &lt;/pgc&gt; &lt;/titles&gt; &lt;/titleset&gt; &lt;/dvdauthor&gt; O arquivo de configuração deve estar localizado no mesmo diretório dos arquivos MPEG. No exemplo acima eu usei a opção &#34;file&#34; para indicar o nome dos arquivos e a opção &#34;chapters&#34; para indicar uma lista de capitulos, essa lista deve ser separada por vírgulas e deve estar no formato H:MM:ss.frac, isso indica que no exemplo acima o primeiro capítulo deve ser criado aos 20 segundos do começo do filme. Depois de criar o arquivo de configuração basta entrar no mesmo diretório dos filmes e executar o comando &#34;dvdauthor -c dvd.xml&#34;. O dvdauthor criará um diretório chamado &#34;dvd&#34; com os subdiretórios AUDIO_TS e VIDEO_TS, nesses diretórios você tem os arquivos necessários para gerar um DVD. Para gravar um DVD você pode usar o comando &#34;growisofs -dvd-compat -Z /dev/dvd -dvd-video dvd&#34;. Se você preferir usar o K3b para queimar o DVD, você deve usar a opção &#34;Novo Projeto de DVD de Vídeo&#34; na aba &#34;Ínicio Rápido&#34; e você só precisará copiar os arquivos de dentro do diretório VIDEO_TS para o diretório VIDEO_TS no seu projeto de DVD de vídeo. Pronto agora você pode usar o Linux para editar os seus DVD&#39;s. Obs: Para instalar o dvdauthor no Slackware 12.1 você pode usar o Slackbuild que pode ser encontrado nessa URL http://slackbuilds.org/repository/12.1/multimedia/dvdauthor/ Até mais!", 
            "tags": "multimedia", 
            "loc": "/2008/06/14/usando-o-dvdauthor-para-editar-dvds/"
        },
        {
            "title": "Convertendo filmes AVI e RMVB para MPEG", 
            "text":"Há um tempo atrás eu estava precisando converter uns filmes no formato AVI e RMVB para MPEG. Depois de ler muitos tutoriais descobri muitas formas de fazer esse tipo de conversão. Acabei escolhendo o mencoder, que é o codificador do projeto mplayer. Eu criei um script para converter todos os filmes de um determinado diretório para o formato MPEG afim de gravá-los em um DVD. Segue o código do script: for filme in `ls *.avi *.rmvb`; do filmempeg=`echo $filme | sed s/.avi/.mpeg/`; echo &#34;Convertendo $filme para $filmempeg&#34;; mencoder -oac lavc -ovc lavc -of mpeg -mpegopts format=dvd:tsaf -vf scale=720:480,harddup -srate 48000 -af lavcresample=48000 -lavcopts vcodec=mpeg2video:vrc_buf_size=1835:vrc_maxrate=9800:vbitrate=5000:keyint=18:vstrict=0:acodec=ac3:abitrate=192:aspect=4/3 -ofps 30000/1001 -o $filmempeg $filme done Esse script cria arquivos MPEG no formato NTSC com uma resolução de 720x480, com 29,97 frames por segundo (30000/1001) e aspecto 4:3. Você pode alterar o script acima e ajustá-lo às duas necessidades. Basta consultar a tabela Format Constraints apresentada no site do Mplayer para obter mais informações e exemplos. Depois altere a linha do comando mencoder de acordo com o que você precisar. Obs: A conversão do formato RMVB para MPEG é muito mais lenta, pois o RMVB tem uma taxa de frames váriavel, portanto prefira baixar filmes no formato AVI. Espero ter ajudado. Até mais!", 
            "tags": "multimedia", 
            "loc": "/2008/05/25/convertendo-filmes-avi-e-rmvb-para-mpeg/"
        },
        {
            "title": "Arquivos .3gp no Mplayer", 
            "text":"Hoje precisei copiar alguns vídeos do celular da minha cunhada. A gente queria converter os vídeos e postar no Youtube. Todos os vídeos do celular estavam no formato 3gp e ao abrí-los no mplayer o vídeo foi reproduzido porém o som estava mudo. Decidi executar o mplayer pela linha de comando para verificar as mensagens de erro e descobri que o mplayer não conseguia encontrar o codec libamr_nb e por isso não reproduzia o som. Ao fazer um pesquisa no Google, descobri as peças que estavam faltando. O formato de arquivo 3gp foi definido pelo grupo 3GPP - 3rd Generation Partnership Project que é composto por vários fabricantes da área de telecomunicações, afim de ditar os padrões a serem usados nos aparelhos de terceira geração, como os celulares GSM. Para ativar o suporte à arquivos 3gp no mplayer dentro do Slackware, nós podemos usar os scripts disponíveis no site Slackbuilds.org. Você precisa baixar os arquivos referentes às bibliotecas amrnb e amrwb. Antes de executar o Slackbuild da biblioteca amrnb você deve baixar o arquivo 26104-700.zip no mesmo diretório do script Slackbuild. Já para a biblioteca amrwb você deve baixar o arquivo 26204-700.zip no mesmo diretório do Slackbuild antes de executar o script para a geração do pacote. Depois que você instalar os pacotes para as bibliotecas amrnb e amrwb, você deve recompilar o mplayer para que ele detecte as novas bibliotecas e passe a usá-las. Para fazer isso você também pode usar Slackbuilds como expliquei no meu post Mplayer no Slackware 12.1 com Slackbuilds. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/17/arquivos-3gp-no-mplayer/"
        },
        {
            "title": "Listando pacotes no Slackware", 
            "text":"Boa tarde. Todos os pacotes que são instalados no Slackware ficam guardados em /var/log/packages. Isso significa que sempre que você quiser saber se tem um determinado pacote instalado você deve listar o conteúdo do diretório /var/log/packages e procurar pelo pacote desejado. Essa é a forma mais rápida, a outra forma de consultar os pacotes instalados é executar como root a ferramenta pkgtool e ir na opção view, então pkgtool listará todos os pacotes instalados. Como eu já estava cansado de ficar executando o comando &#34;ls /var/log/packages/pacotetal*&#34; decidi criar um script que me ajudasse nessa tarefa. Eu queria algo bem simples, algo bem parecido com o comando ls. Então criei o script abaixo e o nomeei lspkg. Dá uma olhada no script: #!/bin/bash cd /var/log/packages/ package_list=`echo $* | sed s/&#34; &#34;/&#34;* &#34;/g | sed s/$/$&#34;*&#34;/ ` for package in $package_list ; do if [ -e $package ] ; then number_of_fields=`echo $package | gawk -F &#34;-&#34; &#39;{ split($0,fields); print length(fields) }&#39;` if [ $number_of_fields == 5 ] ; then name=`echo $package | cut -d - -f 1,2` version=`echo $package | cut -d - -f 3` arch=`echo $package | cut -d - -f 4` build=`echo $package | cut -d - -f 5` else name=`echo $package | cut -d - -f 1` version=`echo $package | cut -d - -f 2` arch=`echo $package | cut -d - -f 3` build=`echo $package | cut -d - -f 4` fi echo -e -n &#34;Package: 33[1m$name33[0m - &#34; echo -n &#34;version: $version - &#34; echo -n &#34;arch: $arch - &#34; echo &#34;build: $build&#34; else package_not_found=`echo $package | tr -d &#34;*&#34;` echo -e &#34;The package 33[1m$package_not_found was not found33[0m in your system.&#34; fi done Agora é só copiar esse código para um arquivo de texto e salvá-lo como lspkg, você também deve dar permissão de execução para esse arquivo e copiá-lo para /usr/bin. Depois de fazer o procedimento acim, faça um teste. Veja o resultado quando executei na minha máquina: bash-3.1$ lspkg ruby bash pkgtoo teste Package: ruby - version: 1.8.6_p114 - arch: i486 - build: 1 Package: bash - version: 3.1.017 - arch: i486 - build: 2 Package: pkgtools - version: 12.1.0 - arch: noarch - build: 7 The package teste was not found in your system. Caso você tenha alguma sugestão para melhorar esse script faça o seu comentário. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/17/listando-pacotes-no-slackware/"
        },
        {
            "title": "Mplayer no Slackware 12.1 com Slackbuilds", 
            "text":"Boa tarde pessoal. No meu último post eu expliquei como fazer a instalação de programas usando Slackbuilds. Como exemplo eu mostrei os passos para a instalação do emulador de terminal Yakuake, e é lógico que o procedimento se aplica para todos os demais Slackbuilds. Porém devemos tomar cuidados com as dependências. Por exemplo, antes de instalar o Mplayer você de ter os pacotes do Lame, que é usado pelo mencoder para gerar audio em mp3, e da biblioteca Libdvdnav, que é usada ler DVDs e os codecs do Mplayer instalados previamente. A seguir os links para os Slackbuilds: Lame: http://slackbuilds.org/repository/12.1/libraries/lame/ Libdvdnav: http://slackbuilds.org/repository/12.1/libraries/libdvdnav/ Todos os codecs para o Mplayer: http://slackbuilds.org/repository/12.1/multimedia/mplayer-codecs-all/ Em cada um dos links citados você deve executar os passos abaixo: 1. Fazer o download do Slackbuild e descompactá-lo, isso criará um diretório com o nome do Slackbuild. 2. Depois você deve fazer o download do código fonte compactado (Download Source) e salvá-lo dentro do diretório do Slackbuild. 3. Abrir um terminal e entrar no diretório do Slackbuild (supondo que o diretório está no seu Desktop &#34;cd ~/Desktop/&lt;nome_do_slackbuild&gt;&#34;) 4. Logar como root, com o comando &#34;su root&#34; 5. Executar o script do Slackbuild &#34;./&lt;nome_do_slackbuild&gt;.Slackbuild&#34; 6. Instalar o pacote criado no diretório /tmp, com o comando &#34;installpkg /tmp/&lt;nome_do_pacote&gt;.tgz&#34; Depois que esses três pacotes estiverem instalados, você pode instalar o Mplayer. O Slackbuild do Mplayer está no link http://slackbuilds.org/repository/12.1/multimedia/MPlayer/. Você vai usar o mesmo procedimento citado acima, a única diferença é que no segundo passo, além do código fonte compactado, você também deve fazer o download do skin no link http://www.mplayerhq.hu/MPlayer/skins/Blue-1.7.tar.bz2 e salvá-lo dentro do diretório do Slackbuild. Feito isso é só continuar. Depois que tudo for instalado você pode apagar os diretórios com os Slackbuilds pois eles não serão mais necessários. Agora é só curtir. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/11/mplayer-no-slackware-121-com-slackbuilds/"
        },
        {
            "title": "Usando Slackbuilds no Slackware 12.1", 
            "text":"Boa tarde para todos! Após atualizar o meu sistema para o Slackware 12.1 precisei instalar alguns programas como o Yakuake e o Mplayer. Fiz uma visita no linuxpackages.net e vi que por enquanto só temos 6 pacotes atualizados para o Slackware 12.1. Isso faz sentido, pois os pacotes do linuxpackages são mantidos pela comunidade e nem todo mundo tem tempo livre pra ficar atualizando pacotes (eu mesmo não atualizei os meus três pacotes que enviei para lá, hehehe). Portanto a galera que quer instalar os programas deve partir para a instalação a partir do código fonte: baixar o fonte, descompactar, dar uma olhada nos arquivos README e INSTALL e finalmente compilar o programa usando os comandos &#34;./configure --prefix=/usr &amp;&amp; make &amp;&amp; make install&#34;. Esses são os passos para instalar um programa direto do código fonte: 1. Baixar o código fonte em /usr/src e descompactá-lo 2. Entrar no diretório do código fonte e ler os arquivos README e INSTALL para obter instruções detalhadas sobre a instalação do programa. 3. Passar vários parâmetros para o comando configure, para ver a lista completa execute ./cofigure --help. Se você não passar nenhum parâmetro para o comando configure, o seu programa será instalado em /usr/local e os arquivos serão divididos nos subdiretórios de /usr/local (por exemplo, os arquivos de configuração ficarão em /usr/local/etc). Para que isso não aconteça você deve passar no mínino as opções mais comuns ao comando configure, como no exemplo a seguir: ./configure --prefix=/usr --sysconfdir=/etc --localstatedir=/var 4. Depois de rodar o configure você deve executar o comando make, para compilar o código fonte, e o make install, para instalar o programa compilado. Ao invés de usar o make install você pode usar o comando checkinstall -S para gerar um pacote do Slackware que será instalado pelo installpkg. Obs: O checkinstall pode ser obtido em http://www.asic-linux.com.mx/~izto/checkinstall/download.php. 5. Para desintalar um programa instalado com o comando make install, você deve manter o diretório com o código fonte compilado e executar o comando make uninstall. Todo esse processo é muito complicado e cansativo, e se você esquecer de passar uma determinada opção para o comando configure, talvez o seu programa não funcionará como esperado. Para automatizar o processo de geração de pacotes para o Slackware a comunidade criou o projeto Slackbuilds.org. Slackbuilds são scripts que contêm todos os passos necessários para a criação de um pacote. No final do processo o pacote será movido para o diretório /tmp para ser instalado no Slackware, usando o pkgtool. Todos os pacotes oficiais do Slackware vêm com um Slackbuild incluído. Vamos supor que você queira instalar o emulador de terminal Yakuake usando um script Slackbuild. Para isso você deve acessar o link http://slackbuilds.org/repository/12.1/system/yakuake/ e baixar o código fonte no link abaixo do título &#34;Download Source&#34; e o script de instalação no link abaixo do título &#34;Download Slackbuild&#34;. Agora você deve descompactar o arquivo do Slackbuild, nesse caso yakuake.tar.gz, fazendo isso será criado um diretório chamado yakuake, mova o arquivo do código fonte para dentro do diretório yakuake. Agora abra um terminal e acesse o diretório yakuake como root e execute o scritpt ./yakuke.Slackbuild. Esse script descompactará o código fonte dentro do diretório /tmp/SBo/yakuake-2.8.1 e fará todos os passos necessários para a criação de um pacote do Slackware. No final do processo você terá um pacote pronto no diretório /tmp. Para instalá-lo execute o comando installpkg /tmp/yakuake-2.8.1-i486-1_SBo.tgz, pronto o yakuake está pronto para usar. Usando um script do slackbuilds.org você pode gerar os seus próprios pacotes sem passar por todas as complicações que o processo manual causaria. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/11/usando-slackbuilds-no-slackware-121/"
        },
        {
            "title": "Visão geral do Slackware 12.1", 
            "text":"Na semana passada fiz a instalação da última versão do Slackware e vou dar uma visão geral do Slackware 12.1. O processo de instalação não mudou. Você inicializa a máquina com um CD ou DVD, escolhe um kernel, usa o cfdisk criar as partições, roda o programa setup e segue a sequêcia apresentada no menu (ADDSWAP, TARGET, SOURCE, SELECT, INSTALL, CONFIGURE). As novidades começam na seção CONFIGURE do instalador. Agora temos a opção de ativar o suporte à caracters UTF8 no terminal. Com isso podemos rodar com mais facilidades os programas que apresentam mensagens em outras línguas. Agora o Slackware traz um pacote do programa scim (Smart Common Input Method) que te permite escrever textos em Chinês simplificado e tradicional, Japonês, Koreano, Árabe, Grego, Russo e muitos idiomas. Mais serviços foram adicionados ao menu que configura os serviços que serão executados durante o processo de boot. Depois que finalizei a configuração e sai do instalador, reiniciei a minha máquina e tive mais uma surpresa. Agora o lilo foi instalado com uma imagem bitmap personalizada para o Slackware 12.1. Após a inicialização do sistema adicionei um usuário usando o script adduser. Esse script foi atualizado e agora pergunta se você quer incluir o usuário nos grupos audio, cdrom, floppy, plugdev e video. Antes a gente tinha que lembrar isso de cabeça e escrever tudo na mão. Por padrão o Slackware usa o diretório /mnt como ponto de montagem padrão para dispositivos como cdrom, disquete, dvd, etc. Caso você queira que esses dispositivos sejam montados automáticamente pelo sistema, você deve abrir o arquivo /etc/fstab e comentar as linhas referentes ao cdrom, dvd e disquete. Fazendo isso o gerenciador de mídia do KDE vai detectar o disco inserido e montá-lo automáticamente pra você. Na minha opinião o Slackware está melhor do que nunca. O sistema traz o kernel 2.6.24.5 com suporte à SMP, Xorg 7.3, KDE 3.5.9, XFCE 4.4.2, Fluxbox 1.0, ntfs-3g com suporte completo para leitura e escrita em NTFS, scim com suporte à muitos idiomas, muitos drivers para placas wireless, interpretadores para muitas linguages de script (Ruby 1.8.6_p114, Python 2.5.2, Perl 5.8.8, TCL 8.4.18), Apache 2.2.8 e muito mais. Slacware 12.1 é o que há! Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/09/visao-geral-do-slackware-121/"
        },
        {
            "title": "Slackware 12.1 - Lançamento oficial", 
            "text":"Boa noite a todos. Trago boas novas para o mundo open source, o Slackware 12.1 foi lançado! Vistem a homepage do Slackware e façam o download da imagem do sistema que já foi liberada. Quinta Mai 1 13:36:34 CDT 2008 O Slackware 12.1 foi lançado como -stable. :-) De novo, muitíssimo obrigado para todo mundo que deixou sua marca e ajudou com relatório de bugs, patches, testes, sugestões, outros comentários, e tudo mais. Sem essa ajuda valiosa, o Slackware não estaria de forma alguma perto do que ele é hoje. Um agradecimento especial para a MASSA, para o povo que está desenvolvendo e testando para o slackbuilds.org (onde primeiramente muitas das futuras adições do Slackware são compiladas e testadas), e para todo mundo no linuxquestions.org, nos vários canais de IRC #slackware ou ##slackware, ou em outros web sites relacionados ao Slackware, e outros lugares onde a comunidade compartilha suas necessidades e considerações com o nosso time. E da parte de todo mundo aqui, obrigado. Nós achamos que você vai curtir esse novo lançamento, e esperamos que você descobrirá que essa versão é muito mais do que 0.1, é bem melhor do que o Slackware 12.0. ;-) Divirtam-se! -P. O que mais podemos fazer, senão seguir o conselho do Patrick e se divertir? Valeu Patrick, obrigado a você e a toda comunidade Linux! Obs: estou começando o download agora mesmo! []&#39;s", 
            "tags": "slackware", 
            "loc": "/2008/05/02/slackware-121-lancamento-oficial/"
        },
        {
            "title": "Slackware 12.1 rc4 - estamos quase lá!", 
            "text":"Ontem a noite tivemos mais atividade no -current. O Patrick lançou o Slackware 12.1 rc4 devido à um patch de segurança que foi aplicado no kernel 2.6.24.5, segue a tradução: Quarta Abr 30 20:36:48 CDT 2008 12.1 RC4. Nós acreditamos que este deve ser o último. a/kernel-generic-2.6.24.5-i486-2.tgz: Patch aplicado para corrigir um problema de segurança em fs/dnotify.c. O uso do dnotify (largamente substituido por inotify nos sistemas 2.6.x) poderia causar um DoS local, ou possívelmente um buraco local para o root. Nós falamos que não fariamos mudanças agora a não ser que algo fosse &#34;crítico&#34; -- e parace que conseguimos o que desejávamos. ;-) Esse problema também será corrigido nas versões anteriores do kernel o mais rápido possível. O patch pode ser encontrado em source/k/linux-2.6.24.5-CVE-2008-1375-patch/. Para informações adicionais (quando o candidato CVE estiver aberto), veja: http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2008-1375 Todos os pacotes do kernel listados abaixo também devem ser considerados correções de segurança. Todos os pacotes relativos ao kernel foram atulizados com o patch de segurança e recompilados, de quebra o Patrick atualizou o programa slackpkg do Piter Punk. Leia o changelog no endereço ftp://ftp.slackware.com/pub/slackware/slackware-current/ChangeLog.txt Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/05/01/slackware-121-rc4-estamos-quase-la/"
        },
        {
            "title": "O Slackware 12.1 está chegando", 
            "text":"Durante as últimas semanas estive acompanhando o changelog do Slackware e vejam só, temos boas notícias. No início do mês o Patrick Volkerding já tinha anunciado que estávamos próximos da versão final do Slackware 12.1 Quinta Abr 3 01:16:15 CDT 2008 OK, vamos chamar isso de Slackware 12.1-rc1, no entanto há ainda algum pequeno trabalho para ser feito. Por favor ajuem a testar! E se nós perdemos alguma coisa grande, por favor me deixe saber em volkerdi@slackware.com. Obrigado. :-) No decorrer do mês vimos muita atividade no -current incluindo o upgrade do kernel para a versão 2.6.24.5. Então na semana passada mais notícias vindas do Patrick: Segunda Abr 21 16:47:32 CDT 2008 Nós alcançamos o Slackware 12.1 RC2. :-) Nós estamos além de atulizar pacotes ou corrigir pequenos bugs de comética neste ponto (na verdade, nós esperamos ter passado isso com o RC1, mas ainda há alguns itens que precisam de atenção). O que nós temos aqui agora tem provado ser estável para os nossos testers, portanto a não ser que alguns problemas reais que possam parar o show sejam encontrados nós lançaremos este como o Slackware 12.1-final em breve. Depois disso vimos atualizações nos pacotes wireless-tools, initrd, jdk e aaa_base e mais uma frase do Patrick: Quarta Abr 23 19:42:28 CDT 2008 Ainda não está completo, mas está chegando perto. Uma semana se passou e vemos mais atividade no -current, incluindo atualizações de segurança nas bibliotecas do KDE, no initrd, na biblioteca libpng e mais algumas pequenas alterações. E então temos a última notícia.: Segunda Abr 28 23:43:55 CDT 2008 Vamos chamar esse de Slackware 12.1 RC3, e congelar a árvore para qualquer coisa que não for crítica. As coisas parecem muito estáveis, então provavelmente isso é uma boa idéia salvar qualquer atualizações e adiciões até que o -current reinicie. É isso ai pessoal, estamos quase lá. Obs: Todas as frases do Patrick foram traduzidas diretamente do changelog que pode ser encontrado na íntegra em ftp://ftp.slackware.com/pub/slackware/slackware-current/ChangeLog.txt, caso você encontre algum erro de tradução, por favor me avise. Até mais!", 
            "tags": "slackware", 
            "loc": "/2008/04/29/o-slackware-121-esta-chegando/"
        },
        {
            "title": "FOX Toolkit e FXRuby no Slackware", 
            "text":"O FOX é um toolkit baseado no C++ para desenvolvimento de aplicações gráficas (também conhecidas como GUIs) de forma fácil e eficaz. O FOX oferece uma coleção vasta e crescente de controles e provê muitas facilidades como arrastar e soltar (drag and drop), seleções e também widgets do Opções (bindings) para várias linguagens. Para programar em Python use FXPy, em Eiffel use EiffelFox e para programar em Ruby use FXRuby. Existem alguns projetos grandes usando FXRuby, entre eles o FreeRIDE que abordei no post anterior, o gerenciador de banco de dados DbTalk e o gerenciador de projetos Mondrian. Veja mais detalhes na homepage http://www.fxruby.org/. Se você usa o Slackware 12 e quer instalar o FOX, você pode baixar o pacote fox-1.6.32-i486-1tdm.tgz. Se você não usa o Slackware você deve pesquisar no repositório da sua distro preferida ou baixar o código fonte e compilar usando o famoso trio &#34;./configure &amp;&amp; make &amp;&amp; make install&#34;. Obs: não deixe de executar ./configure --help para ver quais opções você vai querer ativar. Depois de instalar o FOX você deve instalar o FXRuby usando o comando gem. $ su root # gem install fxruby Veja os exemploes em de código em /usr/lib/ruby/gems/1.8/gems/fxruby-1.6.14/examples/ $ ls -m /usr/lib/ruby/gems/1.8/gems/fxruby-1.6.14/examples/ babelfish.rb, bounce.rb, browser.rb, button.rb, custom_table_item.rb, datatarget.rb, dctest.rb, dialog.rb, dilbert.rb, dirlist.rb, dragdrop.rb, dragsource.rb, dropsite.rb, foursplit.rb, gltest.rb, glviewer.rb, groupbox.rb, header.rb, hello2.rb, hello.rb, iconlist.rb, icons, image.rb, imageviewer.rb, inputs.rb, iRAA.rb, mditest.rb, pig.rb, raabrowser.rb, RAA.rb, ratio.rb, README, rulerview.rb, scintilla-test.rb, scribble-orig.rb, scribble.rb, shutter.rb, splitter.rb, styledtext.rb, tabbook.rb, table.rb, textedit, unicode.rb $ ruby /usr/lib/ruby/gems/1.8/gems/fxruby-1.6.14/examples/hello.rb Pronto agora você pode se divertir fazendo programas multiplataformas usando FXRuby. Quem quiser ir a fundo no assunto pode até comprar o livro do FXRuby http://www.pragprog.com/titles/fxruby. []&#39;s", 
            "tags": "ruby, slackware", 
            "loc": "/2008/04/28/fox-toolkit-e-fxruby-no-slackware/"
        },
        {
            "title": "Usando o FreeRIDE no Linux", 
            "text":"O FreeRIDE (Free Ruby Integrated Development Environment) é um ambiente integrado para desenvolvimento em Ruby, ele foi desenvolvido usando o FxRuby, ou seja, uma versão do  Fox Toolkit para Ruby. O FreeRIDE inclui um interpretador Ruby, um navedor para documentação do Ruby (conhecido como RI ou Ruby Doc). Para instalar o FreeRIDE no Linux você deve fazer o download do arquivo freeride-linux-installer-0.9.6.sh no link a seguir http://rubyforge.org/frs/download.php/10933/freeride-linux-installer-0.9.6.sh Para fazer a instalação você deve dar permissão de execução para o arquivo e executá-lo como root: $ chmod a+x freeride-linux-installer-0.9.6.sh $ su root # ./freeride-linux-installer-0.9.6.sh Você será perguntado em qual diretório o FreeRIDE deve ser instalado, o ideal é instalar o FreeRIDE no diretório padrão. Veja a tela abaixo: FreeRIDE  - starting installation... IMPORTANT NOTE -------------- FreeRIDE must be installed in /usr/local/FreeRIDE. If you want to install it elsewhere a symbolic link will be created from /usr/local/FreeRIDE to the chosen location Choose where to install FreeRIDE [/usr/local] : Installing FreeRIDE. Please wait... --------------------- MANIFEST --------------------- This is version 0.9.6 of FreeRIDE, the Ruby integrated development environment. This version is built with the following components: Ruby               1.8.4 Fox Toolkit        1.2.16 Fox Scintilla      1.62 FXRuby             1.2.6 ---------------------------------------------------- FreeRIDE succesfully installed. Start FreeRIDE with &#39;/usr/local/FreeRIDE/freeride&#39; Agora basta executar o FreeRIDE, no KDE pressione ALT+F2 e aponte para o caminho do executável /usr/local/FreeRIDE/freeride Pronto, agora você pode programar em Ruby usando uma interface gráfica. Obs: O projeto do FreeRIDE foi interrompido na versão 0.9.6, os donos do projeto decidiram reescrever o FreeRIDE usando outro toolkit chamado wxRuby, que usa wxWidgets. Veja o link http://freeride.rubyforge.org/wiki/wiki.pl?FreeRIDE_Future. Para acompanhar o desenvolvimento visite o site http://wxride.ruby-im.net/. []&#39;s", 
            "tags": "ruby, slackware", 
            "loc": "/2008/04/28/usando-o-freeride-no-linux/"
        },
        {
            "title": "Instalando o mplayer no Slackware", 
            "text":"Ontem eu peguei alguns filmes em rmvb e o xine nÃ£o exibia os filmes por causa da falta de plugins (os melhores codecs de multimedia estÃ£o presentes no pacote de codecs do mplayer). EntÃ£o ao invÃ©s de instalar apenas os plugins eu decidi instalar o mplayer completo e usufruir de todos os seus recursos (junto com o mplayer vÃªm um aplicativo chamado mencoder que pode ser usado para ripar DVD&#39;s) A forma mais fÃ¡cil de instalar o mplayer Ã© pegar os pacotes jÃ¡ preparados para o Slackware no site linuxpackages.net Primeiro tive que baixar o mplayer e os codecs: mplayer-1.0rc2try4-i486-1kjz.tgz e mplayer-codecs-20071007-noarch-1szl.tgz Mas como tudo na vida nem sempre Ã© fÃ¡cil, tive que baixar as depÃªncias: a52dec-0.7.4-i486-1kjz.tgz, faac-1.25-i486-1gds.tgz, faad2-2.5-i486-1gds.tgz, ffmpeg-20071007-i486-1kjz.tgz, jack-0.109.2-i486-1mfb.tgz, lame-3.97-i486-1kjz.tgz, libdv-1.0.0-i486-1gds.tgz, libmpcdec-1.2.6-i486-1gds.tgz, speex-1.2beta2-i486-1kjz.tgz, twolame-0.3.12-i486-1kjz.tgz, x264-20070914-i486-1kjz.tgz, xvidcore-1.1.3-i486-1kjz.tgz Depois de tudo isso ... vou assistir os filmes. hehehehe Boa noite!", 
            "tags": "multimedia, slackware", 
            "loc": "/2008/04/18/instalando-o-mplayer-no-slackware/"
        },
        {
            "title": "Usando o SciTE para programar em Ruby", 
            "text":"Nessa última semana estive procurando algumas ferramentas gráficas para programar em Ruby. Hoje eu acabei de testar o SciTE. O SciTE foi criado para demonstrar o poder de um componente de edição de textos chamado Scintilla. Usando o Scintilla você pode criar editores de textos e que podem ser usados para editar o código fonte de programas e chamar compiladores e depuradores externos. O SciTE ficou tão bom que decidiram dar continuidade ao seu desenvolvimento e ele deixou de ser um programa de demonstração e se tornou um editor completo com suporte à várias linguagens, entre elas C/C++, D, C#, Java, PHP e Ruby. Quer testar o programa? Baixe o executável já compilado para Linux no link abaixo (o único pré-requisito é ter uma versão do GTK+ igual ou superior à 2.8 na sua máquina) http://prdownloads.sourceforge.net/scintilla/gscite176.tgz?download Assim que terminar o download, você deve descompactar o arquivo gscite176.tgz; a partir desse ponto o programa já está pronto para rodar, mas muitas funções não estarão funcionando. Para usar todos os recursos do programa você deve fazer o seguinte: 1. Entre no diretório descompactado e copie o executavél SciTE para o diretório /usr/bin (cd gscite; cp SciTE /usr/bin) 2. Crie um diretório /usr/share/scite e copie todos os arquivos com a extenção properties para lá (cp *.properties /usr/share/scite) 3. Copie o arquivo Sci48M.png para o diretório /usr/share/pixmaps (cp Sci48M.png /usr/share/pixmaps) Opicional: Se você quiser ainda pode baixar a tradução do SciTE para Português Brasileiro no endereço a seguir http://groups.google.com/group/scite-interest/web/locale.pt_BR.properties. Basta copiar o arquivo de tradução para o diretório /usr/share/scite com o nome locale.properties (cp locale.pt_BR.properties /usr/share/scite/locale.properties) e reiniciar a aplicação. Pronto agora sim você pode testar o programa a vontade. Pressione ALT+F2 e execute o comando SciTE. Até mais!", 
            "tags": "ruby, slackware", 
            "loc": "/2008/04/17/usando-o-scite-para-programar-em-ruby/"
        },
        {
            "title": "Ruby sem Rails - parte 2", 
            "text":"*Usando mod_ruby, eruby e erubis no Slackware* O mod_ruby é um módulo que permite que o Apache execute de forma nativa os scripts feitos em Ruby. Depois de instalar o mod_ruby você deve escolher qual será o seu gerador de templates, usando um gerador de templates você pode incluir o código Ruby em páginas HTML e programar no mesmo estilo do ASP e PHP. Você pode escolher o ERB que já vem incluído na distribuição padrão do Ruby ou pode usar o eRuby que foi escrito em C para ganho de desempenho. Caso você queira usar o eRuby você precisa instalar ele na sua máquina. O código fonte do mod_ruby e do eruby podem ser encontrados no site http://modruby.net/, mas se você quer facilidade basta baixar os dois pacotes ` &lt;http://fotoleitura.com/downloads/eruby-1.0.5-i486-1tdm.tgz&gt;`__ que fiz para o Slackware 12 e instalar no seu sistema. Baixe os pacotes mod_ruby-1.2.6 e eruby-1.0.5. Depois use a ferramente installpkg para instalar no Slackware. Depois de instalar o mod_ruby e o eruby na sua máquina, você pode instalar também o erubis. O erubis é um gerador de templates, implementado em Ruby e também usa algumas funções do eRuby. O erubis é muito rápido, quase três vezes mais rápido do que o ERB e ainda é 10% mais rápido do que o eRuby, tem suporte à várias linguagens (Ruby/PHP/C/Java/Scheme/Perl/Javascript). Permite que você combine templates com arquivos YAML, para usar arquivos de contexto e tem suporte à Ruby on Rails. Para instalar o erubis você deve baixar os pacotes abstract e erubis do site http://rubyforge.net e executar os comandos abaixo como root: $ tar xjf abstract_1.0.0.tar.bz2 $ cd abstract_1.0.0/ $ su root # ruby setup.rb # exit $ cd .. $ tar xjf erubis-2.5.0.tar.bz2 $ cd erubis-2.5.0/ # su root # ruby setup.rb $ cp contrib/erubis-run /usr/lib/ruby/1.8/apache Agora vamos configurar a integração com o Apache. Inclua as linhas abaixo no seu arquivo /etc/httpd/httpd.conf e salve o arquivo. LoadModule ruby_module lib/httpd/modules/mod_ruby.so &lt;IfModule mod_ruby.c&gt; RubyRequire apache/ruby-run RubyRequire apache/eruby-run RubyRequire apache/erubis-run &lt;Location /erubis&gt; SetHandler ruby-object RubyHandler Apache::ErubisRun.instance &lt;/Location&gt; &lt;Files *.rhtml&gt; SetHandler ruby-object RubyHandler Apache::ErubisRun.instance &lt;/Files&gt; &lt;/IfModule&gt; Depois disso faça com que o usuário apache seja o dono do diretório onde as páginas web estarão. chown -R apache:apache /var/www Isso é necessário pois o erubis precisa de acesso de escrita no diretório htdocs para criar uma área de cache. Para fazer um teste copie o arquivo de exemplo da pasta do erubis para dentro da pasta /var/www/htdocs # cp erubis-2.5.0/examples/basic/example.eruby /var/www/htdocs/example.rhtml Agora abra o arquivo example.rhtml no navegador. Pronto, agora você está rodando Ruby sem Rails! Até mais!", 
            "tags": "ruby, slackware", 
            "loc": "/2008/04/04/ruby-sem-rails-2/"
        },
        {
            "title": "Ruby sem Rails", 
            "text":"*O Ruby e o Rails* Na semana passada comecei a estudar a linguagem Ruby. Li alguns tutoriais e fiquei muito empolgado com a facilidade de uso e com o método de programação. A linguagem Ruby é muito flexivel, nela quase tudo é tratado como um objeto. Se você não acredita e quer ver com seus próprios olhos, dê uma olhada no shell interativo do tutorial TryRuby (em inglês) ou instale o Ruby na sua máquina e siga o tutorial Ruby em Vinte Minutos (bom e velho Português do Brasil!). Aprendi trabalhar com variáveis, fazer loops, criar classes, blocos, etc., porém foi muito difícil encontrar um bom tutorial que me explicasse como usar a liguagem Ruby para gerar páginas dinâmicas, sem usar o framework Rails. Tudo o que eu procurava na web me levava ao Rails. Acredito que isso faz muitas pessoas desistirem de continuar estudando a linguagem. Quero deixar claro que não tenho nada contra o Rails. O Rails é um ótimo framework, faz as coisas se tornarem muito simples, porém fica dificil para o iniciante em Ruby separar o que faz parte do framework e o que faz parte da linguagem em si. E na verdade a pessoa terá que aprender a usar o framework e os novos métodos do Ruby ao mesmo tempo. Se você conhece alguém possa tirar suas dúvidas, acredito que aprender os dois simultâneamente é o caminho a seguir, porém, se como eu você é auto-didata, você pode passar mais um pouco de tempo aprendendo a usar a linguagem Ruby antes de partir para Rails. O Rails foi desenvolvido para aumentar a produtividade, mas se você tem muitas dúvidas sobre Ruby você não será produtivo e pode acabar se confundindo. Por outro lado, se as suas dúvidas quanto a linguagem forem sanadas, você realmente alcançará a produtividade desejada. *O Ruby sem o Rails* Antes de sair procurando na web decidi entar no diretório de instalação do Ruby para revirar o código fonte de alguns scripts e ver se encontrava algo que me apontasse o caminho das pedras. Abri o meu terminal e fiz aquela pergunta que todo bom usuário do Slackware faz &#34;whereis ruby&#34;, uma das respostas apontava para &#34;/usr/lib/ruby/&#34; entrei nesse diretório e encontrei os scripts do Ruby 1.8, alguns minutos depois cheguei ao arquivo erb.rb (outro ponto forte do Ruby, todo script vem com muita documentação incluída em seu código fonte). O ERB é um sistema de template poderoso e de fácil uso, que permite embutir o Ruby dentro de arquivos de texto, xml e até mesmo arquivos HTML. Todo código Ruby que for incluido dentro de tags &lt;% %&gt; será executado como um script Ruby. No fim da documentação encontrei o que estava procurando, segue a tradução: # Há uma variedade de soluções para geração de templates disponíveis em vários projetos feitos em Ruby: # * O grande irmão do ERB, eRuby, trabalha da mesma forma mas é escrito em C para performance; # * Amrita (bom para produzirHTML/XML); # * cs/Template (C para performance); # * RDoc, distribuído com Ruby, usa o seu próprio motor para gerar templates, o qual pode ser usado em qualquer lugar; # * e outros; faça uma busca no RAA. # Rails, o framework para aplicações web, usa ERB para criar views. Isso era tudo o que eu precisava saber. Apartir disso começei a pesquisar na web sobre ERB e eRuby. O eRuby pode executar o código Ruby incluido dentro de páginas HTML e em conjunto com o mod_ruby você pode fazer o Apache servir suas páginas dinâmicas escritas em Ruby (essas páginas levam a extensão .rhtml). Para trabalhar com sessões e recuperar dados de formulários do HTML pelo método POST, você deve criar um objeto CGI dentro do código Ruby e esse objeto fará o trabalho pesado para você. No tutorial de Ruby do Eustáquio Rangel você encontra um exemplo de uso do objeto CGI. Consulte o site do mod_ruby para pegar o código fonte dos e fazer a integração com o Apache. No próximo post vou explicar a integração com o Apache e fornecer os pacotes para instalação no Slackware. Vou ficando por aqui. Até mais!", 
            "tags": "ruby", 
            "loc": "/2008/03/20/ruby-sem-rails-1/"
        },
        {
            "title": "irb(main):001:0&gt; print &#34;Hello world!&#34;", 
            "text":"É isso ai pessoal, eu sou Thiago Silvino e esse é o meu blog pessoal. Vamos usar esse espaçao para compartilhar informações sobre software livre, Linux, redes de computadores e programação. Vamos falar muito sobre o mundo open source, seus aspectos e desafios. Eu faço parte do projeto de tradução do Slackbook para português do Brasil. Quer saber mais sobre o sistema Slackware Linux? Visite o site http://slackbookptbr.sf.net, leia o livro e saiba tudo sobre o sistema Slackware. Estamos iniciando o processo de atualização do livro, precisamos de mais colaboradores, caso queira participar da nossa equipe se inscreva na lista http://groups.google.com/group/slackbookptbr. Até mais!", 
            "tags": "pessoal, slackware", 
            "loc": "/2008/03/11/hello-world-2/"
        },
        {
            "title": "Curriculum", 
            "text":"Conhecimentos e Habilidades *Redes:* Switches L2/L3, VLAN’s, etherchannel, STP, tacacs e roteadores da Cisco e Nortel, firewalls Check Point e ASA/FWSM/PIX Cisco, IPSO e SPLAT, Websense Web Security, VitalQIP e Infoblox DNS e DHCP. *Monitoração:* HP Open View, Cacti, Netcat, Nmap, SNMP, Wireshark, tcpdump e análise de tráfego *Servidores:* Linux Terminal Server (Slackware, Debian e Red Hat), Windows 2000, Windows NT 4.0 *Linux:* Apache, DNS, DHCP, TFTP, iproute2, iptables, NFS, NIS, Samba, Bridge, XDMCP, CUPS *Web**:* XHTML, CSS, DOM, XML, XSLT, PHP, Ruby, ASP, C#, JavaScritpt, AJAX, VBScript *Hardware:* Montagem, manutenção, upgrade, testes e configuração avançadas *Cabling:*Projeto e instalação de cabeamento estruturado e infra-estrutura, manutenção em DG’s *Telefonia:*Ativação e configuração de ramais digitais e analógicos - central telefônica MD110 *Língua estrangeira:*Inglês fluente para escrita, leitura e conversação; Chinês “Mandarim” básico *Experiência Profissional Especialista em Segurança de Redes - AT&amp;T - Campinas - Atual* Responsabilidades: Configuração e administração de firewalls Check Point NGX R60, R61 e R65 nos sistemas operacionais SPLAT, IPSO e Solaris. Administração e configuração dos servidores Websense Web Security. Análise de logs nos firewalls e Websense server. Contenção contra ataques na intranet. Configuração do IPS/IDS SmartDefense. *Administrador de Redes – Microsistec – Praia Grande – Fev./2008 à Mar./2009* Responsabilidades: Administrar os servidores Linux da rede local. Configuração do SAMBA como PDC+GPO’s e NTP. Configuração do ambiente de testes com Apache, PHP e MySQL. Roteamento e compartilhamento da internet com iproute2, Iptables e proxy transparante com Squid. Configuração de uma rádio on-line com Icecast. Administração de Linux Terminal Server na rede Lan. Administração do ambiente que hospeda os sites dos clientes LAMP – Linux, Apache, MySQL e PHP. *Técnico em Informática Senior – Ativa – Atuando na Visteon – Cumbica – Out./2005 à Fev./2008* Responsabilidades: Configuração e monitoração de switches L2/L3, definição de VLAN’s, cálculo de endereços de sub-rede, análise de tráfego, upgrade de IOS, troubleshooting de rede, suporte aos sites de Manaus e Camaçari, contato direto com times do Canadá, EUA, Índia e República Tcheca. Trabalhar junto com os provedores de telecomunicações em caso de falha em algum dos links. Coordenar a equipe de cabeamento estruturado, configurar o PABX Ericsson MD110 e manobrar ramais telefônicos. Gerenciar a fila de chamados nos sistemas ManageNow e Remedy. Participar do processo de IMAC. **Técnico Cabista - NWS – Atuando na Visteon – Cumbica – Dez./2004 à Out./2005 Instrutor de Hardware e Informática – CEBRAC – Praia Grande – Mai./2003 à Dez./2004** *Formação* Superior: Tecnologia em Redes de Computadores - Anhanguera - Campinas - cursando Técnico: Redes de Computadores – SENAI – Santos – Fev./2001 à Dez./2002 *Cursos e Especializações* Cerficação Check Point CCSE- Mai./2010 Cerficação Check Point CCSA - Fev./2010 Certificação Six Sigma -* Yellow Belt - Fev./2010 Certificação Six Sigma - White Belt - Dez./2009 CCNA Módulo I, II e III – ENIAC – Guarulhos –Abr./2007 à Jan./2008 Cabling II &#34;Projeto&#34; – IMPACTA – São Paulo – Set./2004 Cabling I &#34;Cabeamento Estruturado&#34; – IMPACTA – São Paulo – Ago./2004 Inglês Avançado – Universidade Santa Cecília – Santos – Ago./2001 à Dez./2003", 
            "tags": "pages", 
            "loc": "/pages/curriculum/"
        }        
    ]
}